package homework.JavaBeginners;

public class HW6 {

    public static void seq(int l) {
        int end = 0;

        for(int i = 0; end < l; i += 2) {
            System.out.println(i);
            end++;
        }
    }


    public static void main(String[] args) {


//      Написать метод, который принимает параметр  и печатает
//      последовательность четных чисел от нуля. Длина последовательности = l.



        seq(5);

    }








}
